hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v2/TAL_PROVIDERWECHSEL_PV3_04/VZM-PV.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright (c) 2016 - M-net Telekommunikations GmbH
  ~ All rights reserved.
  -->

<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v2"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>PV</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <VZM-PV>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>6002</meldungscode>
                            <meldungstext>nicht ausführbar aus Endkundengrund</meldungstext>
                        </position>
                    </meldungspositionen>
                </VZM-PV>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
